emacs/config.org
* TABLE OF CONTENT :TOC_2:
- [[#elpaca][ELPACA]]
- [[#must-have][MUST-HAVE]]
- [[#keybinds][KEYBINDS]]
- [[#org][ORG]]
  - [[#table-of-content][Table of Content]]
  - [[#bullets][Bullets]]
  - [[#level-header][Level Header]]
  - [[#source-code-tag-expansion][Source code Tag Expansion]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#roam][ROAM]]
- [[#avy][AVY]]
- [[#dired][DIRED]]
- [[#emacs-config][EMACS-CONFIG]]
- [[#multiple-cursors][MULTIPLE-CURSORS]]
- [[#rainbow-delimiters][RAINBOW DELIMITERS]]
- [[#rainbow-mode][RAINBOW MODE]]
- [[#vterm][VTERM]]
- [[#smartparens][SMARTPARENS]]
- [[#corfu][CORFU]]
- [[#magit][MAGIT]]
- [[#anzu][ANZU]]
- [[#themes][THEMES]]
- [[#doom-modeline][DOOM-MODELINE]]
- [[#custom-fonts][CUSTOM-FONTS]]
- [[#nerd-icons][NERD-ICONS]]
- [[#dimmer][DIMMER]]
- [[#winner-undo][WINNER UNDO]]
- [[#window-numbering][Window Numbering]]
- [[#orderless][ORDERLESS]]
- [[#consult][CONSULT]]
- [[#vertico][VERTICO]]
- [[#marginalia][MARGINALIA]]
- [[#which-key][WHICH KEY]]
- [[#indent-bars][INDENT-BARS]]
- [[#isearch][ISEARCH]]
- [[#magit-todos][MAGIT-TODOS]]
- [[#consult-project][CONSULT-PROJECT]]
- [[#drag-stuff][DRAG-STUFF]]
- [[#good-scroll][GOOD-SCROLL]]
- [[#git-gutter][GIT-GUTTER]]
- [[#beacon][BEACON]]
- [[#solaire-mode][SOLAIRE-MODE]]
- [[#dashboard][DASHBOARD]]
- [[#highlight-todo][HIGHLIGHT TODO]]
- [[#embark][EMBARK]]
- [[#activities][ACTIVITIES]]
- [[#forge][FORGE]]
- [[#hs-minor-mode][HS-MINOR-MODE]]
- [[#dired-hacks][DIRED-HACKS]]
- [[#git-timemachine][GIT-TIMEMACHINE]]
- [[#custom-functions][CUSTOM FUNCTIONS]]
- [[#window-swap][WINDOW-SWAP]]
- [[#impatient-mode][IMPATIENT-MODE]]
- [[#buffer-terminator][BUFFER-TERMINATOR]]
- [[#yasnippet][YASNIPPET]]
- [[#emacs-async][EMACS-ASYNC]]
- [[#casual-avy][CASUAL-AVY]]
- [[#org-journal][ORG-JOURNAL]]
- [[#ediff][EDIFF]]
- [[#workgroups2][WORKGROUPS2]]
- [[#languages][LANGUAGES]]
  - [[#kbd-mode][KBD-MODE]]
  - [[#bsv][BSV]]
  - [[#synopsys-design-constraint-sdc][SYNOPSYS DESIGN CONSTRAINT (SDC)]]
  - [[#python][PYTHON]]
  - [[#yaml][YAML]]
  - [[#markdown-mode][MARKDOWN-MODE]]
  - [[#formatting][FORMATTING]]
  - [[#dockerfile][DOCKERFILE]]

* ELPACA
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
				:ref nil :depth 1
				:files (:defaults "elpaca-test.el" (:exclude "extensions"))
				:build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
	 (build (expand-file-name "elpaca/" elpaca-builds-directory))
	 (order (cdr elpaca-order))
	 (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
	  (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
		   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
						   ,@(when-let ((depth (plist-get order :depth)))
						       (list (format "--depth=%d" depth) "--no-single-branch"))
						   ,(plist-get order :repo) ,repo))))
		   ((zerop (call-process "git" nil buffer t "checkout"
					 (or (plist-get order :ref) "--"))))
		   (emacs (concat invocation-directory invocation-name))
		   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
					 "--eval" "(byte-recompile-directory \".\" 0 'force)")))
		   ((require 'elpaca))
		   ((elpaca-generate-autoloads "elpaca" repo)))
	      (progn (message "%s" (buffer-string)) (kill-buffer buffer))
	    (error "%s" (with-current-buffer buffer (buffer-string))))
	((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable :elpaca use-package keyword.
    (elpaca-use-package-mode)
    ;; Assume :elpaca t unless otherwise specified.
    (setq elpaca-use-package-by-default t))
  ;; Block until current queue processed.
  (elpaca-wait)
#+end_src

* MUST-HAVE
#+begin_src emacs-lisp
(setq backup-directory-alist '((".*" . "~/.local/share/Trash/files")))
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(set-language-environment "UTF-8")

;; smart beginning-of-line (BOL)
(defadvice move-beginning-of-line (around smarter-bol activate)
  ;; Move to requested line if needed.
  (let ((arg (or (ad-get-arg 0) 1)))
    (when (/= arg 1)
      (forward-line (1- arg))))
  ;; Move to indentation on first call, then to actual BOL on second.
  (let ((pos (point)))
    (back-to-indentation)
    (when (= pos (point))
      ad-do-it)))


(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
         (next-win-buffer (window-buffer (next-window)))
         (this-win-edges (window-edges (selected-window)))
         (next-win-edges (window-edges (next-window)))
         (this-win-2nd (not (and (<= (car this-win-edges)
                     (car next-win-edges))
                     (<= (cadr this-win-edges)
                     (cadr next-win-edges)))))
         (splitter
          (if (= (car this-win-edges)
             (car (window-edges (next-window))))
          'split-window-horizontally
        'split-window-vertically)))
    (delete-other-windows)
    (let ((first-win (selected-window)))
      (funcall splitter)
      (if this-win-2nd (other-window 1))
      (set-window-buffer (selected-window) this-win-buffer)
      (set-window-buffer (next-window) next-win-buffer)
      (select-window first-win)
      (if this-win-2nd (other-window 1))))))


(global-set-key (kbd "C-x |") 'toggle-window-split)
#+end_src

* KEYBINDS
#+begin_src emacs-lisp 
(use-package general
  :config
  (general-create-definer rgrs-leader-keys
    :prefix "C-x")
  ;; (rgrs-leader-keys
  ;;   ;; "b" '(:ignore t :wk "buffer")
  ;;   "b" '(consult-buffer :wk "Switch buffer")
  ;;   )

  ;; GIT
  ;; (global-unset-key (kbd "C-x g"))
  ;; (rgrs-leader-keys
  ;;   "g" `(:ignore t :wk "Magit")
  ;;   "g c" `(magit-clone :wk "Magit Clone")
  ;;   "g g" `(magit-status :wk "Magit status")
  ;;   "g i" `(magit-init :wk "Magit Init repo")
    
  ;;   )
  (general-define-key
    "<f7>" `display-line-numbers-mode)
  (general-define-key "<f5>" `revert-buffer-quick)
     
  )
#+end_src



* ORG
** Table of Content
#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enablepp
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Bullets
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src

** Level Header
#+begin_src emacs-lisp
(custom-set-faces
'(org-level-1 ((t (:inherit outline-1 :height 1.35))))
'(org-level-2 ((t (:inherit outline-2 :height 1.3))))
'(org-level-3 ((t (:inherit outline-3 :height 1.25))))
'(org-level-4 ((t (:inherit outline-4 :height 1.25))))
'(org-level-5 ((t (:inherit outline-5 :height 1.2))))
'(org-level-6 ((t (:inherit outline-5 :height 1.15))))
'(org-level-7 ((t (:inherit outline-5 :height 1.1)))))
#+end_src

** Source code Tag Expansion
Current Expansions include [[https://orgmode.org/manual/Structure-Templates.html]]

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |
| <el                    | '#+BEGIN_SRC emacs-lisp' … '#+END_SRC'  |


#+begin_src emacs-lisp
(require `org-tempo)
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+end_src

** Disable Electric Indent
#+begin_src emacs-lisp
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

** ROAM
#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/RoamNotes")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(
     ("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
      :unnarrowed t)
     )
   )
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (org-roam-setup))
#+end_src

* AVY
#+begin_src emacs-lisp
(use-package avy
  :config
  (general-define-key "M-s c" `avy-goto-char)
  (general-define-key "M-s C" `avy-goto-char-2)
  (avy-setup-default)
  (global-set-key (kbd "C-c C-j") 'avy-resume)
  (global-set-key (kbd "M-j") `avy-goto-char-timer)
  (general-define-key "M-s s" `avy-copy-line)
  (general-define-key "M-s S" `avy-copy-region)
  )
#+end_src

* DIRED
#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :config
  (setq insert-directory-program "ls" dired-use-ls-dired nil)
  (setq dired-listing-switches "-agho --group-directories-first")
  (setq dired-dwim-target t)
  )

#+end_src

