emacs/config.org
* CUSTOM-FONTS
#+begin_src emacs-lisp
(defface nerd-icons-bluespec-blue
  '((((background dark)) :foreground "#0082f1")
    (((background light)) :foreground "#0082f1"))
  "Face for bluespec blue."
  :group 'nerd-icons-faces)

;; custom 
(defcustom fontello-font-family "fontello"
  "The Nerd Font for display icons."
  :group 'nerd-icons
  :type 'string)

(require 'fontello  "~/.config/emacs/fonts/fontello.el")
#+end_src

* NERD-ICONS
#+begin_src emacs-lisp
(use-package nerd-icons
  :config
  (add-to-list 'nerd-icons-extension-icon-alist `("bsv"   nerd-icons-fontello "nf-bluespec"    :face nerd-icons-bluespec-blue))
  (add-to-list 'nerd-icons-mode-icon-alist `(bsv-mode   nerd-icons-fontello "nf-bluespec"    :face nerd-icons-bluespec-blue))
  (nerd-icons-define-icon fontello nerd-icons/fontello-alist fontello-font-family "Fontello")
  )

(use-package nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package nerd-icons-ibuffer
  :ensure t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-corfu
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
)


;; Optionally:
;; (setq nerd-icons-corfu-mapping
;;       '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
;;         (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
;;         ;; ...
;;         (t :style "cod" :icon "code" :face font-lock-warning-face)))
;; Remember to add an entry for `t', the library uses that as default.

;; The Custom interface is also supported for tuning the variable above.


#+end_src

* DIMMER
#+begin_src emacs-lisp :tangle no
(use-package dimmer
:config
(dimmer-configure-which-key)
(dimmer-mode t))

#+end_src

* WINNER UNDO
#+begin_src emacs-lisp
(winner-mode 1)
#+end_src

* Window Numbering
#+begin_src emacs-lisp 
(use-package winum
:config
(winum-mode))

(global-set-key (kbd "C-0") 'winum-select-window-0)
(global-set-key (kbd "C-1") 'winum-select-window-1)
(global-set-key (kbd "C-2") 'winum-select-window-2)
(global-set-key (kbd "C-3") 'winum-select-window-3)
(global-set-key (kbd "C-4") 'winum-select-window-4)
(global-set-key (kbd "C-5") 'winum-select-window-5)
(global-set-key (kbd "C-6") 'winum-select-window-6)
(global-set-key (kbd "C-7") 'winum-select-window-7)
(global-set-key (kbd "C-8") 'winum-select-window-8)
#+end_src

* ORDERLESS
#+begin_src emacs-lisp
(use-package orderless
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src


* CONSULT
#+begin_src emacs-lisp
(use-package consult
  :config
  (require 'consult-imenu)

  (when (boundp 'consult-imenu-config)
    (add-to-list 'consult-imenu-config
                 '(bsv-mode
                   :toplevel "Modules"
                   :types ((?m "Modules" font-lock-function-name-face)
                           (?r "Rules" font-lock-function-name-face)))))
  (consult-customize
   consult-line
   :add-history (seq-some #'thing-at-point '(region symbol)))
  
  (defalias 'consult-line-thing-at-point 'consult-line)
  
  (consult-customize
   consult-line-thing-at-point
   :initial (thing-at-point 'symbol))
:bind (
       ("C-x b" . consult-buffer)
       ("M-g i" . consult-imenu)
       ("C-x r b" . consult-bookmark)
       ("M-s l" . consult-line)
       ("M-s L" . consult-line-thing-at-point)
       ("M-s g" . consult-grep)
       ("M-s r" . consult-ripgrep)
       ("M-g g" . consult-goto-line) 
       ("M-g M-g" . consult-goto-line)
       ("C-x p b" . consult-project-buffer)
       ("M-y"     . consult-yank-from-kill-ring)
       ;; M-s bindings in `search-map'
       ("M-s d" . consult-find) 
       ("M-s k" . consult-keep-lines)
       ("M-s u" . consult-focus-lines)
       ("M-g m" . consult-mark)
       )
)


#+end_src

* VERTICO
#+begin_src emacs-lisp
(use-package vertico
  :init
  (vertico-mode))

(use-package savehist
  :ensure nil
  :init
  (savehist-mode))

(setq enable-recursive-minibuffers t)
#+end_src

* MARGINALIA
#+begin_src emacs-lisp
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

#+end_src

* WHICH KEY
#+begin_src emacs-lisp
(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit nil
        which-key-separator " → " ))
#+end_src

* INDENT-BARS
#+begin_src emacs-lisp
(use-package indent-bars
  :ensure (:host github :repo "jdtsmith/indent-bars")
  :hook ((prog-mode) . indent-bars-mode)
  )
#+end_src

* ISEARCH
#+begin_src emacs-lisp
(use-package isearch
  :ensure nil
  :bind
  ("C-*" . 'isearch-forward-symbol-at-point)
  )
#+end_src

* MAGIT-TODOS
#+begin_src emacs-lisp
(use-package magit-todos
  :after magit
  :config (magit-todos-mode 1))
#+end_src

* CONSULT-PROJECT
#+begin_src emacs-lisp
(use-package consult-project-extra
  :bind
  (("C-c p f" . consult-project-extra-find)
   ("C-c p o" . consult-project-extra-find-other-window)
   ;; ("C-x b" . consult-project-buffer)
   )
  )
#+end_src

* DRAG-STUFF
#+begin_src emacs-lisp
(use-package drag-stuff
  :config
  (drag-stuff-global-mode 1)
  (drag-stuff-define-keys)
  )
#+end_src

* GOOD-SCROLL
#+begin_src emacs-lisp
(use-package good-scroll
  :config
  (good-scroll-mode 1)
  (global-set-key [next] #'good-scroll-up-full-screen)
  (global-set-key [prior] #'good-scroll-down-full-screen)
)
#+end_src

* GIT-GUTTER
#+begin_src emacs-lisp
(use-package git-gutter
  :config
  (global-git-gutter-mode 1)
)
#+end_src

* BEACON
#+begin_src emacs-lisp
(use-package beacon
  :config
  (beacon-mode 1)
)
#+end_src

* SOLAIRE-MODE
#+begin_src emacs-lisp
(use-package solaire-mode
  :config
  (solaire-global-mode +1)
)
#+end_src


* DASHBOARD 
#+begin_src emacs-lisp
(use-package dashboard
  :config
  (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
  (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
  (dashboard-setup-startup-hook))

(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

;; Set the title
;; (setq dashboard-banner-logo-title "Life is all about MinMacs")
;; Set the banner
;; (setq dashboard-startup-banner "/home/rohit/.config/emacs/images/Final_Splash_screen.txt")
;; Value can be
;; - nil to display no banner
;; - 'official which displays the official emacs logo
;; - 'logo which displays an alternative emacs logo
;; - 1, 2 or 3 which displays one of the text banners
;; - "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer
;; - a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

;; Content is not centered by default. To center, set
(setq dashboard-center-content t)

;; To disable shortcut "jump" indicators for each section, set
(setq dashboard-show-shortcuts t)

(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))
(setq dashboard-display-icons-p t)
(setq dashboard-icon-type 'nerd-icons)
(setq dashboard-set-heading-icons t)
(setq dashboard-set-file-icons t)
#+end_src

