emacs/config.org
* HIGHLIGHT TODO 
#+begin_src emacs-lisp
(use-package hl-todo
  :hook ((org-mode . hl-todo-mode)
         (prog-mode . hl-todo-mode))
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(("TODO"       warning bold)
          ("FIXME"      error bold)
          ("HACK"       font-lock-constant-face bold)
          ("REVIEW"     font-lock-keyword-face bold)
          ("NOTE"       success bold)
          ("DEPRECATED" font-lock-doc-face bold))))

#+end_src

* EMBARK
#+begin_src emacs-lisp
(use-package embark
  :ensure t

  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init

  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package wgrep)

#+end_src

* ACTIVITIES 
#+begin_src emacs-lisp
(use-package activities
  :init
  (activities-mode)
  (activities-tabs-mode)
  ;; Prevent `edebug' default bindings from interfering.
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  :bind
  (("C-x C-a C-n" . activities-new)
   ("C-x C-a C-d" . activities-define)
   ("C-x C-a C-a" . activities-resume)
   ("C-x C-a C-s" . activities-suspend)
   ("C-x C-a C-k" . activities-kill)
   ("C-x C-a RET" . activities-switch)
   ("C-x C-a b" . activities-switch-buffer)
   ("C-x C-a g" . activities-revert)
   ("C-x C-a l" . activities-list)))
#+end_src 

* FORGE 
#+begin_src emacs-lisp
(use-package forge
  :after magit
  :config
  (setq auth-sources '("~/.authinfo"))
)
#+end_src

* HS-MINOR-MODE
#+begin_src emacs-lisp
(use-package hs-minor-mode
  :ensure nil
  :hook prog-mode
  :bind
  (("C-c f" . hs-toggle-hiding)
   ("C-c l" . hs-hide-level)
   ("C-c U" . hs-show-all)
   )
  )
#+end_src

* DIRED-HACKS
#+begin_src emacs-lisp
(use-package dired-hacks-utils)

(use-package dired-filter)

;; (use-package dired-avfs)

(use-package dired-open
  :config
  (setq dired-open-extensions '(("vcd" . "surfer")
				("fst" . "surfer"))))


(use-package dired-rainbow
  :config
  (progn
    (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
    (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
    (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
    (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
    (dired-rainbow-define markdown "#ffad4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
    (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
    (dired-rainbow-define media "#de751f" ("mp3" "mp4" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
    (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
    (dired-rainbow-define log "#c17d11" ("log"))
    (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
    (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
    (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java" "bsv"))
    (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
    (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
    (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
    (dired-rainbow-define encrypted "#ff0d4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
    (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
    (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
    (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
    (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*")
    ))

(use-package dired-subtree
  :config
  (define-key dired-mode-map (kbd "i") `dired-subtree-toggle)
  )

(use-package dired-ranger
  :bind 
  (:map dired-mode-map
	("C-c c" . dired-ranger-copy)
	("C-c y" . dired-ranger-paste)
	("C-c r" . dired-ranger-move)
   ))


(use-package dired-narrow)

(use-package dired-list)

(use-package dired-collapse)

#+end_src


* GIT-TIMEMACHINE
#+begin_src emacs-lisp
(use-package git-timemachine)
#+end_src

* CUSTOM FUNCTIONS
#+begin_src emacs-lisp
(defun switch-to-minibuffer ()
  "Switch to minibuffer window."
  (interactive)
  (if (active-minibuffer-window)
      (select-window (active-minibuffer-window))
    (error "Minibuffer is not active")))

(global-set-key (kbd "C-`") #'switch-to-minibuffer) 

(defun prot-simple-keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(global-set-key (kbd "C-g") #'prot-simple-keyboard-quit-dwim) 
#+end_src

* WINDOW-SWAP
#+begin_src emacs-lisp
(global-set-key (kbd "C-c C-<left>") 'windmove-swap-states-left )
(global-set-key (kbd "C-c C-<right>") 'windmove-swap-states-right )
(global-set-key (kbd "C-c C-<up>") 'windmove-swap-states-up )
(global-set-key (kbd "C-c C-<down>") 'windmove-swap-states-down )
#+end_src

* IMPATIENT-MODE
#+begin_src emacs-lisp
(use-package impatient-mode)
#+end_src

* BUFFER-TERMINATOR
#+begin_src emacs-lisp
(use-package buffer-terminator
  :ensure t
  :custom
  (buffer-terminator-verbose nil)
  :config
  (buffer-terminator-mode 1))
#+end_src

* YASNIPPET
#+begin_src emacs-lisp
(use-package yasnippet
  :config
  (yas-global-mode 1)
  )

(use-package yasnippet-snippets)

(use-package consult-yasnippet
  :config
  (general-define-key "C-c i s" `consult-yasnippet)
)
#+end_src

* EMACS-ASYNC
#+begin_src emacs-lisp
(use-package async
  :custom
  (autoload 'dired-async-mode "dired-async.el" nil t)
  (dired-async-mode 1)
  )

#+end_src

* CASUAL-AVY
#+begin_src emacs-lisp
(use-package casual-avy
  :bind 
  (
   ("M-s t" . casual-avy-tmenu)
   )
  )

#+end_src

* ORG-JOURNAL
#+begin_src emacs-lisp
(use-package org-journal)
#+end_src

* EDIFF
#+begin_src emacs-lisp
(use-package ediff
  :ensure nil
  :init
  (setq ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
)
#+end_src

* WORKGROUPS2
#+begin_src emacs-lisp
(use-package workgroups2
  :config
  (setq wg-prefix-key "C-c z")
  (setq wg-session-file "~/.config/emacs/.emacs_workgroups")
  (workgroups-mode 1)
  :bind
  (
   ("C-x C-a c" . wg-create-workgroup)
   ("C-x C-a o" . wg-open-workgroup)
   ("C-x C-a k" . wg-kill-workgroup)
   ("C-x C-a s" . wg-switch-to-workgroup)
   )
  )
#+end_src

* LANGUAGES
