emacs/config.org
** KBD-MODE
#+begin_src emacs-lisp
(use-package kbd-mode 
  :ensure (:host github :repo "kmonad/kbd-mode")
  ;;(kbd-mode-kill-kmonad "pkill -9 kmonad")
  ;;(kbd-mode-start-kmonad "kmonad ~/path/to/config.kbd")
)
#+end_src

** BSV
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/emacs/languages/bsv/")
(add-to-list 'load-path "~/.config/emacs/languages/bsv/emacs20-extras.el")
(add-to-list 'load-path "~/.config/emacs/languages/bsv/mark.el")

(autoload 'bsv-mode "bsv-mode" "BSV mode" t )
(setq auto-mode-alist (cons  '("\\.bsv\\'" . bsv-mode) auto-mode-alist))
(setq auto-mode-alist (cons  '("\\.defines\\'" . bsv-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.defs\\'" . bsv-mode) auto-mode-alist))
(setq bsv-indent-level 2)
(setq bsv-indent-level-module 2)
(setq bsv-indent-level-declaration 2)
(setq bsv-indent-level-directive 2)
(setq bsv-indent-level-behavioral 2)
(setq bsv-cexp-indent 2)
(setq bsv-tab-always-indent nil)

;;TODO: ADD ICON for BLUESPEC
(defun bsv-append-method-name-to-endmethod ()
  "Improved version with exact method name capture"
  (when (and (eq major-mode 'bsv-mode)
             (save-excursion
               (beginning-of-line)
               (looking-at "^\\s-*endmethod\\s-*$")))
    (let ((method-name nil))
      (save-excursion
        (when (re-search-backward 
               "^\\s-*method\\s-+\\(?:\\S-+\\s-+\\)?\\([^ \t\n(]+\\)\\s-*(" 
               nil t)
          (setq method-name (match-string 1))))
      (when method-name
        (end-of-line)
        (unless (looking-back (concat ":\\s-*" method-name "\\s-*") (line-beginning-position))
          (insert (concat ": " method-name)))))))


(defun bsv-endmethod-advice (orig-fun &rest args)
  "Same advice wrapper as before"
  (apply orig-fun args)
  (bsv-append-method-name-to-endmethod))

(advice-add 'bsv-complete-or-indent-command :around #'bsv-endmethod-advice)


#+end_src

** SYNOPSYS DESIGN CONSTRAINT (SDC)
#+begin_src emacs-lisp
(setq auto-mode-alist (cons '("\\.sdc\\'" . tcl-mode) auto-mode-alist))

#+end_src

** PYTHON
#+begin_src emacs-lisp
(use-package anaconda-mode
:config
(add-hook 'python-mode-hook 'anaconda-mode))

#+end_src

** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
:config
(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
(add-hook 'yaml-mode-hook
    '(lambda ()
    (define-key yaml-mode-map "\C-m" 'newline-and-indent)))

)


#+end_src

** MARKDOWN-MODE
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))

#+end_src

** FORMATTING
#+begin_src emacs-lisp
(defun rgrs/spc_4_indent ()
 "Updates the indent tabs mode to nil"
(interactive)
(setq indent-tabs-mode nil))

(defun rgrs/test_print ()
 "Updates the indent tabs mode to nil"
(interactive)
(message "BSV-Mode loaded"))
(add-hook 'bsv-mode-hook #'rgrs/spc_4_indent)
(add-hook 'bsv-mode-hook 'rgrs/test_print)
(add-hook 'prog-hook #'rgrs/spc_4_indent)

#+end_src

** DOCKERFILE
#+begin_src emacs-lisp
(use-package dockerfile-mode)
#+end_src
